[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.js:40:27
                 message: "Max length 10 characters",
               },
             })}
-            defaultValue={initialContents?.orgCode ?? ""}
+            defaultValue={initialContents.orgCode ?? ""}
             disabled={Boolean(initialContents)}
           />
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'orgCode')

[Survived] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationForm.js:40:27
                 message: "Max length 10 characters",
               },
             })}
-            defaultValue={initialContents?.orgCode ?? ""}
+            defaultValue={initialContents?.orgCode && ""}
             disabled={Boolean(initialContents)}
           />

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.js:94:27
           label="Inactive"
           data-testid={`${testIdPrefix}-inactive`}
           {...register("inactive")}
-          defaultChecked={initialContents?.inactive ?? false}
+          defaultChecked={initialContents.inactive ?? false}
           // If you ever want validation feedback on a checkbox:
           // isInvalid={Boolean(errors.inactive)}
killedBy: UCSBOrganizationsCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'inactive')

[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:94:56
           label="Inactive"
           data-testid={`${testIdPrefix}-inactive`}
           {...register("inactive")}
-          defaultChecked={initialContents?.inactive ?? false}
+          defaultChecked={initialContents?.inactive ?? true}
           // If you ever want validation feedback on a checkbox:
           // isInvalid={Boolean(errors.inactive)}
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "inactive": false,
+   "inactive": true,
