[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:58:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
-            required: "Org Translation Short is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:59:23
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
-            required: "Org Translation Short is required.",
+            required: "",
             maxLength: {
               value: 30,
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:93:24
           id="inactive"
           label="Inactive"
           data-testid={`${testIdPrefix}-inactive`}
-          {...register("inactive")}
+          {...register("")}
           //defaultChecked={initialContents?.inactive ?? false}
         />
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
