[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBOrganizations/edit/${cell.row.values.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganizations/edit/ZPR"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/UCSBOrganizations/edit/${cell.row.values.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganizations/edit/ZPR"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationTable.js:54:13
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests more table tests test checkbox
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No
Received:
