[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:11:13
   const objectToAxiosParams = (ucsbOrganization) => ({
     url: "/api/ucsborganizations/post",
     method: "POST",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      inactive: ucsbOrganization.inactive,
-    },
+    params: {},
   });
 
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": false,
-   "orgCode": "ZPR",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:19:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(
-      `New UCSB Organization Created - org code: ${ucsbOrganization.orgCode} org translation: ${ucsbOrganization.orgTranslation}`,
-    );
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New UCSB Organization Created - org code: ZPR org translation: ZETA PHI RHO"

Number of calls: 0
