[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganizations?orgCode=${orgCode}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganizations`,
-      params: {
-        orgCode,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:22:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/ucsborganizations`,
+      url: ``,
       params: {
         orgCode,
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:29:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgTranslation: ucsbOrganization.orgTranslation,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: ZPR org translation: ZETA PHI RHO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:42:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(
-      `UCSB Organization Updated - orgCode: ${ucsbOrganization.orgCode} org translation: ${ucsbOrganization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:44:7
 
   const onSuccess = (ucsbOrganization) => {
     toast(
-      `UCSB Organization Updated - orgCode: ${ucsbOrganization.orgCode} org translation: ${ucsbOrganization.orgTranslationShort}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: ZPR org translation: ZETA PHI RHO"
Received: ""

Number of calls: 1

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbOrganization}
-          />
-        )}
+        {ucsbOrganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbOrganization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {orgCode, orgTranslation, orgTranslationShort, inactive}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbOrganization}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
