[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:58:28
     {
       Header: "Request Time (in UTC)",
       accessor: "requestTime",
-      Cell: ({ value }) => {
-        const date = new Date(value);
-        return isNaN(date.getTime())
-          ? value
-          : date.toISOString().replace(".000", "");
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: HelpRequestTable tests Request Time is displayed correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2025-04-30T06:26:00Z
Received:

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:62:48
         const date = new Date(value);
         return isNaN(date.getTime())
           ? value
-          : date.toISOString().replace(".000", "");
+          : date.toISOString().replace(".000", "Stryker was here!");
       },
     },
killedBy: HelpRequestTable tests Request Time is displayed correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2025-04-30T06:26:00Z
Received:
  2025-04-30T06:26:00Stryker was here!Z
