[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/HelpRequest/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/HelpRequest/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:52:15
       accessor: "teamId",
     },
     {
-      Header: "Table/Breakout Room #",
+      Header: "",
       accessor: "tableOrBreakoutRoom",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table/Breakout Room #. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tabl

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:63:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Has it been solved?",
-      accessor: "solved",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
-    },
+    {},
   ];
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:65:17
     },
     {
       Header: "Has it been solved?",
-      accessor: "solved",
+      accessor: "",
       Cell: ({ value }) => (value ? "Yes" : "No"),
     },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
