[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/HelpRequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /HelpRequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New Help Request Created - id: ${helpRequest.id} explanation: ${helpRequest.explanation}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /HelpRequest
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Help Request Created - id: 4 explanation: I can't figure out how to delete a help request post"

Number of calls: 0
