[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:132:27
               type="datetime-local"
               isInvalid={Boolean(errors.requestTime)}
               {...register("requestTime", {
-                required: "Request Time is required.",
+                required: "",
                 pattern: isodate_regex,
               })}
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:150:39
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "Explanation is required.",
-            maxLength: {
-              value: 255,
-              message: "Explanation - Max length 255 characters",
-            },
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:170:24
           id="solved"
           type="checkbox"
           isInvalid={Boolean(errors.solved)}
-          {...register("solved", {})}
+          {...register("", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
