[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/HelpRequest",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Help Request Updated - id: 17 explanation: I need help with my project."
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/HelpRequest",
+    url: "",
     method: "PUT",
     params: {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Help Request Updated - id: 17 explanation: I need help with my project."
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.js:30:13
 
   const objectToAxiosPutParams = (helpRequest) => ({
     url: "/api/HelpRequest",
-    method: "PUT",
+    method: "",
     params: {
       id: helpRequest.id,
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsEditPage.js:63:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/HelpRequest" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/HelpRequest"}

Number of calls: 0
