[Killed] BooleanLiteral
main/pages/UCSBMenuItemReview/UCSBMenuItemReviewCreatePage.js:8:68
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBMenuItemReviewCreatePage({ storybook = false }) {
+export default function UCSBMenuItemReviewCreatePage({ storybook = true }) {
   const objectToAxiosParams = (review) => ({
     url: "/api/ucsbdiningcommonsmenuitemreview/post",
killedBy: UCSBMenuItemReviewCreatePage tests submits form and navigates correctly
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbmenuitemreview"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBMenuItemReview/UCSBMenuItemReviewCreatePage.js:9:31
 import { toast } from "react-toastify";
 
 export default function UCSBMenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/ucsbdiningcommonsmenuitemreview/post",
-    method: "POST",
-    params: review,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: UCSBMenuItemReviewCreatePage tests submits form and navigates correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/UCSBMenuItemReview/UCSBMenuItemReviewCreatePage.js:15:33
     params: review,
   });
 
-  const onSuccess = (review) => {
-    toast(`New Review Created - id: ${review.id}`);
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
killedBy: UCSBMenuItemReviewCreatePage tests submits form and navigates correctly
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Review Created - id: 42"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBMenuItemReview/UCSBMenuItemReviewCreatePage.js:16:11
   });
 
   const onSuccess = (review) => {
-    toast(`New Review Created - id: ${review.id}`);
+    toast(``);
   };
 
killedBy: UCSBMenuItemReviewCreatePage tests submits form and navigates correctly
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Review Created - id: 42"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBMenuItemReview/UCSBMenuItemReviewCreatePage.js:27:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbmenuitemreview" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBMenuItemReviewCreatePage tests submits form and navigates correctly
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbmenuitemreview"}

Number of calls: 0
