[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:14:32
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues: initialContents || {} });
+  } = useForm({ defaultValues: false });
 
   const navigate = useNavigate();
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Error: expect(element).toHaveValue(Portola)

Expected the element to have value:
  Portola
Received:

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:14:32
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues: initialContents || {} });
+  } = useForm({ defaultValues: initialContents && {} });
 
   const navigate = useNavigate();
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Error: expect(element).toHaveValue(Portola)

Expected the element to have value:
  Portola
Received:

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:21:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItemForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:21:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItemForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDiningCommonsMenuItemForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
       </Row>
 
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:50:27
               type="text"
               isInvalid={Boolean(errors.diningCommonsCode)}
               {...register("diningCommonsCode", {
-                required: "Dining Commons Code is required.",
+                required: "",
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
