[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommonsmenuitem/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitem/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:19:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommonsmenuitem/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitem/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id",
-    },
-    {
-      Header: "Dining Commons Code",
-      accessor: "diningCommonsCode",
-    },
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:42:5
       Header: "id",
       accessor: "id",
     },
-    {
-      Header: "Dining Commons Code",
-      accessor: "diningCommonsCode",
-    },
+    {},
     {
       Header: "Name",
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:43:15
       accessor: "id",
     },
     {
-      Header: "Dining Commons Code",
+      Header: "",
       accessor: "diningCommonsCode",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Dining Commons Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:51:15
       accessor: "name",
     },
     {
-      Header: "Station",
+      Header: "",
       accessor: "station",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Station. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:62:9
         "Edit",
         "primary",
         editCallback,
-        "UCSBDiningCommonsMenuItemTable",
+        "",
       ),
     );
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
