[Killed] ConditionalExpression
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:14:32
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues: initialContents || {} });
+  } = useForm({ defaultValues: true });
 
   const navigate = useNavigate();
killedBy: UCSBMenuItemReviewForm tests renders correctly when passing in a UCSBMenuItemReview
statusReason: Error: expect(element).toHaveValue(student@ucsb.edu)

Expected the element to have value:
  student@ucsb.edu
Received:

[Killed] ConditionalExpression
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:21:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBMenuItemReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
       </Row>
 
killedBy: UCSBMenuItemReviewForm tests renders correctly when passing in a UCSBMenuItemReview
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:21:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBMenuItemReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBMenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
       </Row>
 
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:52:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail?.message}
+              {errors.reviewerEmail.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:65:28
               id="stars"
               type="number"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
+              {...register("", {
                 required: "Stars are required.",
                 // minLength: { value: 1, message: "Minimum is 1" },
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:72:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars?.message}
+              {errors.stars.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:92:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed?.message}
+              {errors.dateReviewed.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:105:28
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", { required: "Item ID is required." })}
+              {...register("", { required: "Item ID is required." })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:108:16
               {...register("itemId", { required: "Item ID is required." })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId?.message}
+              {errors.itemId.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:124:40
               as="textarea"
               rows={3}
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", { required: "Comments are required." })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemReviewForm tests Shows error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:124:52
               as="textarea"
               rows={3}
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", { required: "Comments are required." })}
+              {...register("comments", { required: "" })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemReviewForm tests Shows error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBMenuItemReview/UCSBMenuItemReviewForm.js:127:16
               {...register("comments", { required: "Comments are required." })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments?.message}
+              {errors.comments.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
