[Killed] BlockStatement
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:15:34
 export default function UCSBMenuItemReviewTable({ reviews, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate("/ucsbmenuitemreview/edit/" + cell.row.values.id);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBMenuItemReviewTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbmenuitemreview/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:34:15
 
   const columns = [
     {
-      Header: "ID",
+      Header: "",
       accessor: "id",
     },
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:35:17
   const columns = [
     {
       Header: "ID",
-      accessor: "id",
+      accessor: "",
     },
     {
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:37:5
       Header: "ID",
       accessor: "id",
     },
-    {
-      Header: "Reviewer Email",
-      accessor: "reviewerEmail",
-    },
+    {},
     {
       Header: "Stars",
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:39:17
     },
     {
       Header: "Reviewer Email",
-      accessor: "reviewerEmail",
+      accessor: "",
     },
     {
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewTable-cell-row-0-col-reviewerEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:42:15
       accessor: "reviewerEmail",
     },
     {
-      Header: "Stars",
+      Header: "",
       accessor: "stars",
     },
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Stars. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:46:15
       accessor: "stars",
     },
     {
-      Header: "Date Reviewed",
+      Header: "",
       accessor: "dateReviewed",
     },
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Reviewed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:51:17
     },
     {
       Header: "Comments",
-      accessor: "comments",
+      accessor: "",
     },
     {
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewTable-cell-row-0-col-comments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:53:5
       Header: "Comments",
       accessor: "comments",
     },
-    {
-      Header: "Item ID",
-      accessor: "itemId",
-    },
+    {},
   ];
 
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:59:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemReviewTable"),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "UCSBMenuItemReviewTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:65:9
     );
     columns.push(
       ButtonColumn(
-        "Delete",
+        "",
         "danger",
         deleteCallback,
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBMenuItemReview/UCSBMenuItemReviewTable.js:77:15
     <OurTable
       data={reviews}
       columns={columns}
-      testid={"UCSBMenuItemReviewTable"}
+      testid={""}
     />
   );
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
