[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: MenuItemReviewTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/ucsbdiningcommonsmenuitem",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBDiningCommonsMenuItemUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
